#### Assignment 3

In [1]:
import pandas as pd
dirty = pd.read_csv('Group026_dirty_data.csv')
dirty.head()

,order_id,date,time,order_type,branch_code,order_items,order_price,customer_lat,customer_lon,customerHasloyalty?,distance_to_customer_KM,delivery_fee
0,ORDK08089,18/10/2018,17:38:01,Dinner,BK,"[('Pasta', 9), ('Salmon', 1), ('Fish&Chips', 1...",431.5,-37.823772,144.982539,0,6.835,13.994718
1,ORDI05679,6/08/2018,15:05:54,Lunch,NS,"[('Chicken', 5), ('Fries', 5), ('Burger', 5), ...",623.8,-37.805138,144.964186,0,7.068,12.683499
2,ORDJ09514,2018-30-06,13:54:55,Lunch,TP,"[('Burger', 3), ('Steak', 10), ('Chicken', 7)]",767.0,-37.805550,144.935397,0,10.742,14.913298
3,ORDZ06702,15/11/2018,18:28:43,Dinner,BK,"[('Shrimp', 3), ('Fish&Chips', 8), ('Salmon', 5)]",647.0,-37.823825,144.959297,0,9.960,15.393485
4,ORDJ03750,8/11/2018,18:18:35,Dinner,TP,"[('Pasta', 1), ('Salmon', 1)]",68.5,-37.813677,145.012955,0,12.277,15.217138

In [2]:
branch=pd.read_csv('branches.csv')
branch.head()

  branch_code branch_name  branch_lat  branch_lon
0          NS   Nickolson  -37.773803  144.983647
1          TP    Thompson  -37.861835  144.905716
2          BK      Bakers  -37.815834  145.046450

In [3]:
print(branch)

  branch_code branch_name  branch_lat  branch_lon
0          NS   Nickolson  -37.773803  144.983647
1          TP    Thompson  -37.861835  144.905716
2          BK      Bakers  -37.815834  145.046450

In [4]:
dirty.describe(include='O')

,order_id,date,time,order_type,branch_code,order_items
count,500,500,500,500,500,500
unique,500,295,72,3,6,497
top,ORDA06385,2/04/2018,11:12:40,Breakfast,NS,"[('Shrimp', 3), ('Salmon', 3)]"
freq,1,6,12,188,158,2

In [5]:
dirty.branch_code.value_counts()

NS    158
BK    155
TP    154
ns     13
bk     11
tp      9
Name: branch_code, dtype: int64

In [6]:
dirty.branch_code.replace({'ns':'NS', 'bk':'BK', 'tp':'TP'},inplace=True)

In [7]:
dirty.branch_code.value_counts()

NS    171
BK    166
TP    163
Name: branch_code, dtype: int64

In [8]:
outlier=pd.read_csv('Group026_outlier_data.csv')
outlier.head()

,order_id,date,time,order_type,branch_code,order_items,order_price,customer_lat,customer_lon,customerHasloyalty?,distance_to_customer_KM,delivery_fee
0,ORDY02448,2018-04-05,11:02:32,Breakfast,TP,"[('Coffee', 1), ('Pancake', 8), ('Cereal', 4)]",285.5,-37.801972,144.993970,0,11.272,13.491511
1,ORDK02456,2018-06-09,13:14:21,Lunch,BK,"[('Steak', 5), ('Fries', 9), ('Salad', 10), ('...",660.0,-37.804342,144.948859,0,8.880,17.305048
2,ORDX05363,2018-12-29,20:00:00,Dinner,BK,"[('Pasta', 5), ('Fish&Chips', 2), ('Shrimp', 2...",479.5,-37.815720,144.937145,0,10.049,19.947093
3,ORDI01233,2018-06-30,13:54:55,Lunch,NS,"[('Fries', 2), ('Chicken', 4)]",152.0,-37.818778,144.952849,0,10.101,17.683454
4,ORDK10204,2018-07-23,14:45:38,Lunch,BK,"[('Steak', 2), ('Chicken', 6), ('Burger', 9)]",561.0,-37.808594,144.948182,0,8.942,15.583234

In [9]:
breakfast=outlier[outlier.order_type=='Breakfast']
breakfast['order_items'].head()

0        [('Coffee', 1), ('Pancake', 8), ('Cereal', 4)]
6     [('Coffee', 7), ('Pancake', 4), ('Eggs', 8), (...
8         [('Cereal', 8), ('Eggs', 8), ('Pancake', 10)]
10    [('Cereal', 4), ('Coffee', 9), ('Eggs', 2), ('...
12                         [('Eggs', 4), ('Cereal', 3)]
Name: order_items, dtype: object

In [10]:
import re

value = []
bfitems=[]
for i in breakfast['order_items']:
    value.append(i)

In [11]:
flatten=[]
for item in value:
    flatten.append(item)

In [12]:
node=pd.read_csv('nodes.csv')

In [13]:
type(node.lat)
lat=set(node.lat)

In [14]:
type(lat)

set

In [16]:
for i in dirty.customer_lat:
    if i not in lat:
        print(i)

37.819111799999995
144.98681499999998
37.810861100000004
37.8218255
144.967727
37.8195117
37.8178333
37.799082299999995
37.8149591
37.8027244
37.8158152
37.818758
144.9478494
37.8096732
37.813342799999994
37.8093802
37.8065078
37.8063865
37.8176281
37.8062519
37.813995299999995
37.7997629
37.8118559
145.0003489
37.815135999999995
37.808570200000005
37.800740399999995
37.805916100000005
37.8077318
37.812397
37.814504299999996
37.821442499999996
37.824182799999996
37.8247325
37.8270191
37.8005658
37.8217484
37.8215945
37.8050924
37.8246967
37.8124455

In [24]:
import pandas as pd
import numpy as np

df = pd.DataFrame([{'c1':10, 'c2':100, 'c3':200}, {'c1':11,'c2':110, 'c3':200}, {'c1':12,'c2':120, 'c3':200}])
df

   c1   c2   c3
0  10  100  200
1  11  110  200
2  12  120  200

In [22]:
for index, row in df.iterrows():
    print(row['c1'], row['c2'])

10 100
11 110
12 120

In [25]:
df.at[2,'c3'] = 2
df

   c1   c2   c3
0  10  100  200
1  11  110  200
2  12  120    2

In [26]:
for i in df.c1:
    i = i *100
df

   c1   c2   c3
0  10  100  200
1  11  110  200
2  12  120    2

In [27]:
import datetime as dt

d = dt.time(8,0,0)

In [28]:
d

datetime.time(8, 0)

In [29]:
print(d)

08:00:00